"""8.1. Відловлюємо некоректні символи в списку чисел."""

"""Створіть масив зі строками, які будуть складатися з чисел,
які розділені комою. Наприклад: [”1,2,3,4”, ”1,2,3,4,50” ”qwerty1,2,3”]
Для кожного елементу списку виведіть суму всіх чисел
(створіть нову функцію для цього).
Якщо є символи, що не є числами (”qwerty1,2,3” у прикладі),
вам потрібно зловити вийняток і вивести “Не можу це зробити!”
Використовуйте блок try/except, щоб уникнути інших символів,
окрім чисел у списку.
Для цього прикладу правильний вивід буде:
10, 60, “Не можу це зробити”
"""


def sum_of_nums(string):
    """
    Розраховує суму чисел у рядку, розділеному комами.

    Якщо рядок містить нечислові символи, виводить "Не можу це зробити!"
    """
    try:
        numbers = [int(num) for num in string.split(',')]
        return sum(numbers)
    except ValueError:
        return 'Не можу це зробити!'


string_array = ['1,2,3,4', '1,2,3,4,50', 'qwerty1,2,3']

for string in string_array:
    result = sum_of_nums(string)
    print(result)
